//Задача 1: Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
// int a = Convert.ToInt32(Console.ReadLine());

// if (a%7==0 && a%23==0)
// {
//     Console.WriteLine("Число делится на 7 и 23");
// }
// else
// {
//     Console.WriteLine("Число не делится на 7 и 23 ");
// }
/////////////////////////////////////////////////////////

//Задача 2: Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер координатной четверти плоскости, в которой находится эта точка.
// int x = Convert.ToInt32(Console.ReadLine());
// int y = Convert.ToInt32(Console.ReadLine());
// if (x>0&&y>0&& x!=0 && y!=0)
// {
//     Console.WriteLine("1");
// }
// if (x>0&&y<0&& x!=0 && y!=0)
// {
//     Console.WriteLine("4");
// }
// if (x<0&&y<0&& x!=0 && y!=0)
// {
//     Console.WriteLine("3");
// }
// if (x<0&&y>0&& x!=0 && y!=0)
// {
//     Console.WriteLine("2");
// }
// if ( x==0 || y==0)
//    {
//     Console.WriteLine("`x` или `y` равна нулю");
// }
//////////////////////////////////////////////////////
//Задача 3: Напишите программу, которая принимает на вход целое число из отрезка [10, 99] и показывает наибольшую цифру числа.

// int a = new Random().Next(10,99);
// Console.WriteLine(a);
// int b = a%10;
// int c = a*10/100;
// if (b>c)
// {
//     Console.WriteLine(b);
// }
// else
// {
//     Console.WriteLine(c);
// }
///////////////////////////////////////////////////////
//Задача 4: Напишите программу, которая на вход принимает натуральное число N, а на выходе показывает его цифры через запятую.
// int a = new Random().Next(100,1000);
// Console.WriteLine(a);
// int c = a*100/10000;
// Console.Write(c+",");

// int b = a%100;
// int d = b/10;
//  Console.Write(d+",");
// int e = a%10;
//  Console.Write(e+"");

 